app/controllers/pages_controller.rb

SELECT  `aware_device`.* FROM `aware_device` WHERE `aware_device`.`device_id` = '1a7be15e-909b-80de-782a-1789889caade' LIMIT 1
INSERT INTO `contexts` (`user_id`, `start_time`, `end_time`, `latitude`, `longitude`, `app_id`, `percentage`, `description`, `duration`) VALUES ('1a7be15e-909b-80de-782a-1789889caade', 1518877800000, 1518883200000, 53.34913498, -6.26122408, 34, 54, 'One', 5400000)
INSERT INTO `used_locations` (`ID`) VALUES (643)
---
  def myLocationsThree
    current_user
    @userdevice = Device.find_by(_id: @current_user.aware_device_id).device_id
    @test = ""
    if session[:locations] != nil && session[:effectiveness] != nil
      session[:locations].each do |loc|
        location = LocationReport.find(loc[0].to_i)
        entrytime = Time.at(location.timestamp.to_i / 1000)
        arrived = Time.parse(loc[1]["arrived"])
        departed = Time.parse(loc[1]["departed"])
        fromtime = Time.new(entrytime.year, entrytime.month, entrytime.day, arrived.hour, arrived.min)
        totime = Time.new(entrytime.year, entrytime.month, entrytime.day, departed.hour, departed.min)
        UsageReport.where(device_id: @userdevice).where(timestamp: (fromtime.to_i * 1000)..(totime.to_i * 1000)).each do |apprep|
          new_context = Context.new
          new_context.user_id = @userdevice
          #new_context.topic_id
          new_context.start_time = fromtime.to_i * 1000
          new_context.end_time = totime.to_i * 1000
          new_context.latitude = location.double_latitude
          new_context.longitude = location.double_longitude
          new_context.app_id = App.find_by(package_name: apprep.package_name).ID
          #new_context.topics
          new_context.percentage = session[:effectiveness][loc[0]]["effect"]
          new_context.description = loc[1]["description"]
          new_context.duration = (totime.to_i * 1000) - (fromtime.to_i * 1000)
          new_context.save