app/controllers/sessions_controller.rb

  def create
    user = User.find_by(Username: params[:session][:username])
---
SELECT  `users`.* FROM `users` WHERE `users`.`Username` = '' LIMIT 1